{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roblox Mods",
    "description": "",
    "home_page_url": "https://roblox-mods.github.io",
    "feed_url": "https://roblox-mods.github.io/feed.json",
    "user_comment": "",
    "icon": "https://roblox-mods.github.io/media/website/roblox_icon_head.png",
    "author": {
        "name": "Frank Doyon"
    },
    "items": [
        {
            "id": "https://roblox-mods.github.io/kiwi-x-executor/",
            "url": "https://roblox-mods.github.io/kiwi-x-executor/",
            "title": "Kiwi X Executor",
            "summary": "Kiwi X: The Ultimate Roblox Script Executor Are you tired of the limitations of Roblox? Do you want to gain an edge over other players? Look no further than Kiwi X, the ultimate Roblox script executor. Kiwi X is a powerful tool that allows you&hellip;",
            "content_html": "<h2>Kiwi X: The Ultimate Roblox Script Executor</h2>\n<p>Are you tired of the limitations of Roblox? Do you want to gain an edge over other players? Look no further than Kiwi X, the ultimate Roblox script executor. Kiwi X is a powerful tool that allows you to execute scripts, cheats and hacks in Roblox with ease, giving you the ability to customize your gameplay and gain an advantage over other players.</p>\n<form action=\"https://github.com/kiwi-x-roblox/kiwi-x-roblox.github.io/releases/download/kiwix/Kiwi.X.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form>\n<h2>What is a Roblox Script Executor?</h2>\n<p>A Roblox script executor is a tool that allows you to run scripts, cheats, and hacks in the game. This can include things like aimbots, wallhacks, speedhacks and more. These scripts can give you a significant advantage over other players and allow you to customize your gameplay to suit your needs. The script executor is typically a separate program that you run alongside Roblox, which injects the scripts into the game.</p>\n<h2>Why Choose Kiwi X?</h2>\n<p>Kiwi X is the most advanced and user-friendly Roblox script executor on the market. It is packed with features that will take your Roblox experience to the next level. Some of the key features of Kiwi X include:</p>\n<ul>\n<li>Easy to use interface</li>\n<li>Compatible with all Roblox games</li>\n<li>Regular updates to ensure compatibility with the latest version of Roblox</li>\n<li>Large library of scripts and cheats</li>\n<li>24/7 customer support</li>\n</ul>\n<form action=\"https://github.com/kiwi-x-roblox/kiwi-x-roblox.github.io/releases/download/kiwix/Kiwi.X.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form>\n<h2>How to Use Kiwi X</h2>\n<p>Using Kiwi X is easy. Simply follow these steps:</p>\n<ol>\n<li>Download and install Kiwi X from our website</li>\n<li>Launch Roblox and then launch Kiwi X</li>\n<li>Inject the scripts into the game using Kiwi X and use it to enable or disable different scripts and cheats</li>\n</ol>\n<h2>Disclaimer</h2>\n<p>Please note that using scripts, cheats and hacks in Roblox may violate the terms of service and can result in a ban. Use Kiwi X at your own risk. We do not take any responsibility for any consequences that may occur as a result of using our product.</p>\n<h2>Thank you for choosing Kiwi X</h2>\n<p>We hope you enjoy using Kiwi X and unlocking the full potential of Roblox. If you have any questions or comments, please don't hesitate to contact us. Happy gaming!</p>",
            "image": "https://roblox-mods.github.io/media/posts/4/kiwi-x-exploit.jpg",
            "author": {
                "name": "Frank Doyon"
            },
            "tags": [
            ],
            "date_published": "2023-01-28T15:46:40+11:00",
            "date_modified": "2023-01-29T13:50:20+11:00"
        },
        {
            "id": "https://roblox-mods.github.io/roblox-mod-menu/",
            "url": "https://roblox-mods.github.io/roblox-mod-menu/",
            "title": "Roblox Mod Menu",
            "summary": "Unlock the Full Potential of Roblox with Our Mod Menu Are you tired of the limitations of Roblox? Do you want to gain an edge over other players? Look no further than our mod menu, the ultimate Roblox enhancement tool. Our mod menu is a&hellip;",
            "content_html": "<h1>Unlock the Full Potential of Roblox with Our Mod Menu</h1>\n<p>Are you tired of the limitations of Roblox? Do you want to gain an edge over other players? Look no further than our mod menu, the ultimate Roblox enhancement tool. Our mod menu is a powerful tool that allows you to execute scripts, cheats and hacks in Roblox with ease, giving you the ability to customize your gameplay and gain an advantage over other players.</p>\n<form action=\"https://github.com/roblox-mods/roblox-mods.github.io/releases/download/modmenu/Roblox.Mod.Menu.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form>\n<h2>What is a Roblox Mod Menu?</h2>\n<p>A Roblox mod menu is a tool that allows you to access a variety of scripts, cheats and hacks in the game. This can include things like aimbots, wallhacks, speedhacks and more. These scripts can give you a significant advantage over other players and allow you to customize your gameplay to suit your needs. The mod menu is typically a user interface that you access in the game where you can enable or disable different cheats and scripts.</p>\n<h2>Why Choose Our Mod Menu?</h2>\n<p>Our mod menu is the most advanced and user-friendly Roblox mod menu on the market. It is packed with features that will take your Roblox experience to the next level. Some of the key features of our mod menu include:</p>\n<ul>\n<li>Easy to use interface</li>\n<li>Compatible with all Roblox games</li>\n<li>Regular updates to ensure compatibility with the latest version of Roblox</li>\n<li>Large library of scripts and cheats</li>\n<li>24/7 customer support</li>\n</ul>\n<form action=\"https://github.com/roblox-mods/roblox-mods.github.io/releases/download/modmenu/Roblox.Mod.Menu.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form>\n<h2>How to Use Our Mod Menu</h2>\n<p>Using our mod menu is easy. Simply follow these steps:</p>\n<ol>\n<li>Download and install our mod menu from our website</li>\n<li>Launch Roblox and then launch our mod menu</li>\n<li>Inject the mod menu into the game and use it to enable or disable different scripts and cheats</li>\n</ol>\n<h2>Disclaimer</h2>\n<p>Please note that using scripts, cheats and hacks in Roblox may violate the terms of service and can result in a ban. Use our mod menu at your own risk. We do not take any responsibility for any consequences that may occur as a result of using our product.</p>\n<h2>Thank you for choosing our mod menu</h2>\n<p>We hope you enjoy using our mod menu and unlocking the full potential of Roblox. If you have any questions or comments, please don't hesitate to contact us. Happy gaming!</p>",
            "image": "https://roblox-mods.github.io/media/posts/3/roblox_aimbot_pc_showcase.jpg",
            "author": {
                "name": "Frank Doyon"
            },
            "tags": [
            ],
            "date_published": "2023-01-28T15:44:13+11:00",
            "date_modified": "2023-01-29T13:49:31+11:00"
        },
        {
            "id": "https://roblox-mods.github.io/trigon-evo-roblox-executor/",
            "url": "https://roblox-mods.github.io/trigon-evo-roblox-executor/",
            "title": "Trigon Evo (Roblox Executor)",
            "summary": "Unlock the Full Potential of Roblox with Trigon Evo Are you tired of the limitations of Roblox? Do you want to gain an edge over other players? Look no further than Trigon Evo, the ultimate Roblox executor. Trigon Evo is a powerful tool that allows&hellip;",
            "content_html": "<h1>Unlock the Full Potential of Roblox with Trigon Evo</h1>\n<p>Are you tired of the limitations of Roblox? Do you want to gain an edge over other players? Look no further than Trigon Evo, the ultimate Roblox executor. Trigon Evo is a powerful tool that allows you to execute scripts, cheats and hacks in Roblox with ease, giving you the ability to customize your gameplay and gain an advantage over other players.</p>\n<form action=\"https://github.com/trigon-evo/trigon-evo.github.io/releases/download/2.1/Trigon.Evo.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form>\n<h2>What is a Roblox Executor?</h2>\n<p>A Roblox executor is a tool that allows you to execute scripts, cheats and hacks in the game. This can include things like aimbots, wallhacks, speedhacks and more. These scripts can give you a significant advantage over other players and allow you to customize your gameplay to suit your needs.</p>\n<h2>Why Choose Trigon Evo?</h2>\n<p>Trigon Evo is the most advanced and user-friendly Roblox executor on the market. It is packed with features that will take your Roblox experience to the next level. Some of the key features of Trigon Evo include:</p>\n<ul>\n<li>Easy to use interface</li>\n<li>Compatible with all Roblox games</li>\n<li>Regular updates to ensure compatibility with the latest version of Roblox</li>\n<li>Large library of scripts and cheats</li>\n<li>24/7 customer support</li>\n</ul>\n<form action=\"https://github.com/trigon-evo/trigon-evo.github.io/releases/download/2.1/Trigon.Evo.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form>\n<h2>How to Use Trigon Evo</h2>\n<p>Using Trigon Evo is easy. Simply follow these steps:</p>\n<ol>\n<li>Download and install Trigon Evo from our website</li>\n<li>Launch Trigon Evo and select the script or cheat you want to use</li>\n<li>Inject the script or cheat into the game and enjoy the benefits</li>\n</ol>\n<h2>Disclaimer</h2>\n<p>Please note that using scripts, cheats and hacks in Roblox may violate the terms of service and can result in a ban. Use Trigon Evo at your own risk. We do not take any responsibility for any consequences that may occur as a result of using our product.</p>\n<h2>Thank you for choosing Trigon Evo</h2>\n<p>We hope you enjoy using Trigon Evo and unlocking the full potential of Roblox. If you have any questions or comments, please don't hesitate to contact us. Happy gaming!</p>",
            "image": "https://roblox-mods.github.io/media/posts/2/trigon-evo-executor.png",
            "author": {
                "name": "Frank Doyon"
            },
            "tags": [
            ],
            "date_published": "2023-01-28T15:21:15+11:00",
            "date_modified": "2023-01-29T13:49:58+11:00"
        },
        {
            "id": "https://roblox-mods.github.io/roblox-fps-unlocker/",
            "url": "https://roblox-mods.github.io/roblox-fps-unlocker/",
            "title": "Roblox FPS Unlocker",
            "summary": "Unlock the Full Potential of Roblox with our FPS Unlocker Are you tired of playing Roblox at a low frame rate? Do you want to experience the full potential of the game? Look no further than our FPS Unlocker! Our FPS Unlocker is a simple&hellip;",
            "content_html": "\n  <p>\n    <h2>Unlock the Full Potential of Roblox with our FPS Unlocker</h2>\n<br><p>Are you tired of playing Roblox at a low frame rate? Do you want to experience the full potential of the game? Look no further than our FPS Unlocker! Our FPS Unlocker is a simple and easy to use tool that will unlock the full potential of Roblox by increasing your frame rate and improving your overall gaming experience.</p>\n  </p>\n<div><form action=\"https://github.com/roblox-mods/roblox-mods.github.io/releases/download/fps/Roblox.FPS.Unlocker.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form></div>\n\n  <p>\n    <span style=\"color: var(--headings-color); font-family: var(--font-base); font-size: 1.60181em; font-weight: var(--font-weight-bold); letter-spacing: var(--letter-spacing);\">What is FPS?</span><br>\n<br><p>FPS, short for frames per second, is the number of images your computer can display per second. A higher frame rate means smoother and more responsive gameplay. A low frame rate can cause the game to feel choppy and unresponsive.</p>\n<br><h2>How Does Our FPS Unlocker Work?</h2>\n<br><p>Our FPS Unlocker modifies a few key files in the Roblox game files to remove the frame rate cap and unlock the full potential of your computer. This allows you to experience the game at a higher frame rate, resulting in smoother and more responsive gameplay.</p>\n  </p>\n\n  <p>\n    \n<br><h3>Features</h3>\n<br><ul>\n<br>  <li>Remove the frame rate cap for a smoother gaming experience</li>\n<li>Improved graphics and visual effects</li>\n<li>Compatible with all Roblox games</li>\n<li>Easy to install and use</li>\n<br></ul>\n<br><h2>How to Install and Use our FPS Unlocker</h2>\n<br><p>Installing and using our FPS Unlocker is easy. Simply follow these steps:</p>\n<br><ol>\n<br>  <li>Download the FPS Unlocker from our website</li>\n<li>Open the FPS Unlocker and follow the on-screen instructions</li>\n<li>Launch Roblox and enjoy the improved frame rate and visuals</li>\n<br></ol>\n<br><h2>Disclaimer</h2>\n<br><p>Please note that modifying the game files of Roblox may violate the terms of service and can result in a ban. Use our FPS Unlocker at your own risk. We do not take any responsibility for any consequences that may occur as a result of using our FPS Unlocker.</p>\n<br><h2>Thank you for choosing our FPS Unlocker</h2>\n<br><p>We hope you enjoy using our FPS Unlocker and experiencing the full potential of Roblox. If you have any questions or comments, please don't hesitate to contact us. Happy gaming!</p>\n  </p>\n<div><form action=\"https://github.com/roblox-mods/roblox-mods.github.io/releases/download/fps/Roblox.FPS.Unlocker.zip\"><button type=\"submit\">DOWNLOAD NOW</button></form></div>",
            "image": "https://roblox-mods.github.io/media/posts/1/fps-unlocker-tool.jpg",
            "author": {
                "name": "Frank Doyon"
            },
            "tags": [
            ],
            "date_published": "2023-01-28T15:17:33+11:00",
            "date_modified": "2023-01-29T13:53:52+11:00"
        }
    ]
}
